Revit 2027 API
RebarShapeConstraintFixedSegmentDir.Direction Property
 The direction of the RebarShapeSegment in UV-space.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Direction { get; set; }
Public Property Direction As UV
	Get
	Set
public:
property UV^ Direction {
	UV^ get ();
	void set (UV^ value);
}
member Direction : UV with get, set
Property Value
UV
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarShapeConstraintFixedSegmentDir Class
Autodesk.Revit.DB.Structure Namespace